embeddedci-com/benchpod-firmware/stm32h563/src/net_server.c
static bool iface_addressed(const net_if_t *i) {
    return i->dhcp.state == NET_DHCP_DONE;
}

/* ---- at_driver transmit seam ---------------------------------------------
   Called by command_handler / scpi_server ON THE WORKER TASK.  Because lwIP is
   single-threaded on the net task, replies are NOT written to lwIP here — they go
   into the per-connection conn_tx rings (or the console/cloud sinks) and the net
   task drains them (net_tx_drain). */
int at_send_data(int conn_id, const uint8_t *buf, size_t len)
{
    if (conn_id == CH_CONSOLE_CONN) {        /* console replies -> local console (thread-safe) */
        console_io_write(buf, len);
        return 0;
    }
    /* Cloud command channel: capture the reply (worker-local buffer) so it can be
       framed as a command.response once the worker finishes the command. */
    if (conn_id == CH_CLOUD_CONN) {
        command_handler_cloud_capture_append(buf, len);
        return 0;
    }
    /* Real TCP conns and cloud tunnels: enqueue into the conn's TX ring; the net
       task moves it into lwIP.  A short write (ring full) is reported as failure so
       the caller closes the (evidently stuck) connection. */
    if (conn_tx_slot(conn_id) >= 0)
        return (conn_tx_write(conn_id, buf, len) == len) ? 0 : -1;
    return -1;
}

size_t at_send_avail(int conn_id)
{
    if (conn_id == CH_CONSOLE_CONN) return 0xFFFFu;   /* local console: blocking sink */
    if (conn_id == CH_CLOUD_CONN)   return 0xFFFFu;   /* captured to RAM, framed once */
    /* Real TCP conns and cloud tunnels: pace against the ring free space (the net
       task, in turn, only drains a tunnel ring as fast as the TLS/WS send buffer
       allows — so bulk_pump can never overrun the wire).  This ring-based pacing
       replaced reading tcp_sndbuf / cloud_client_tunnel_avail directly, which is
       lwIP state the worker task must not touch. */
    if (conn_tx_slot(conn_id) >= 0) return conn_tx_free(conn_id);
    return 0;
}

/* Worker-side request to close a connection: flag it; the net task performs the
   actual lwIP close in net_poll and then notifies the worker (WK_CLOSED). */
int at_close_connection(int conn_id)
{
    if (conn_id < 0 || conn_id >= NET_MAX_CONN) return -1;
    s_close_req[conn_id] = 1;
    return 0;
}

/* Worker-side request to toggle Nagle: record the desired state; net applies it. */
int at_set_tcp_nodelay(int conn_id, bool enable)
{
    if (conn_id < 0 || conn_id >= NET_MAX_CONN) return -1;
    s_nodelay_req[conn_id] = enable ? 1 : 0;
    return 0;
}

/* ---- connectivity-status seam (reports the active/default interface) ---- */
wifi_state_t wifi_get_state(void)
{
    return (iface_addressed(&s_eth) || iface_addressed(&s_wifi)) ? WIFI_READY
                                                                 : WIFI_DISCONNECTED;
}
const char *wifi_get_ip(void)
{
    if (iface_addressed(&s_eth))  return s_eth.ip;   /* Ethernet preferred */
    if (iface_addressed(&s_wifi)) return s_wifi.ip;
    return "0.0.0.0";
}

const char *wifi_sta_ip(void)
{
    return iface_addressed(&s_wifi) ? s_wifi.ip : "(none)";
}
int wifi_get_rssi(int *out_rssi_dbm) { if (out_rssi_dbm) *out_rssi_dbm = -1; return -1; }

/* ---- raw TCP server callbacks ------------------------------------------ */
static int conn_id_of(void *arg) { return (int)(intptr_t)arg - 1; }

static err_t srv_recv(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err)
{
    int id = conn_id_of(arg);

    if (p == NULL) {                          /* remote closed */
        if (id >= 0 && id < NET_MAX_CONN) { hw_worker_submit_closed(id); conn_pcb[id] = NULL; }
        tcp_arg(tpcb, NULL); tcp_recv(tpcb, NULL); tcp_err(tpcb, NULL);
        tcp_close(tpcb);
        return ERR_OK;
    }
    if (err != ERR_OK) { pbuf_free(p); return err; }

    /* Hand the inbound bytes to the worker task (it owns command_handler).
       ALL-OR-NOTHING: only consume this pbuf if the WHOLE thing fits the worker
       queue right now; otherwise return ERR_MEM without consuming or freeing it, so
       lwIP keeps the pbuf and redelivers it later (tcp_fasttmr retries refused data
       ~every 250 ms; any later inbound segment retries it sooner) once the worker
       has drained.  The queue is sized so a full receive window always fits when
       drained (see the _Static_assert above), so this never deadlocks.

       This replaces an earlier path that consumed a prefix and then DROPPED the
       rest when the queue filled mid-pbuf — which silently TRUNCATED a fast bulk
       upload (e.g. a >=32 KB deep-replay `load_bin{psram}`): the received byte
       count never reached `total`, so the completion ack never fired and the client
       timed out.  See docs / the concurrent-capture hwe2e tests. */
    if (id >= 0 && id < NET_MAX_CONN) {
        if (!hw_worker_can_accept(p->tot_len)) return ERR_MEM;

        static uint8_t seg[HW_WORK_DATA_MAX];   /* net task only (single-threaded) */
        u16_t off = 0;
        while (off < p->tot_len) {
            u16_t n = (u16_t)(p->tot_len - off);
            if (n > sizeof(seg)) n = sizeof(seg);
            pbuf_copy_partial(p, seg, n, off);
            /* can_accept() reserved room, so this succeeds on the common path.  If
               another producer task (console) raced a slot away in between, wait
               briefly for the worker to drain instead of truncating the tail — the
               pbuf is already partly consumed and can't be rewound for redelivery. */
            int spins = 0;
            while (!hw_worker_submit_bytes(id, seg, n)) {
                vTaskDelay(pdMS_TO_TICKS(5));
                if (++spins >= 100) {            /* ~0.5 s: worker wedged (should never) */
                    /* We already consumed `off` bytes of this pbuf into the worker and
                       cannot rewind, so acking a prefix and dropping the tail would
                       SILENTLY TRUNCATE the stream — corrupting a deep-replay/bulk
                       upload exactly like the pre-all-or-nothing bug. Abort the
                       connection instead: the client sees a reset and can retry
                       cleanly rather than receiving a corrupt trace. */
                    printf("[net] conn %d: worker wedged mid-pbuf after %u/%u bytes — "
                           "aborting to avoid silent truncation\n",
                           id, (unsigned)off, (unsigned)p->tot_len);
                    hw_worker_submit_closed(id);
                    conn_pcb[id] = NULL;
                    tcp_arg(tpcb, NULL); tcp_recv(tpcb, NULL); tcp_err(tpcb, NULL);
                    pbuf_free(p);
                    tcp_abort(tpcb);
                    return ERR_ABRT;
                }
            }
            off += n;
        }
        tcp_recved(tpcb, p->tot_len);
        pbuf_free(p);
        return ERR_OK;
    }
    tcp_recved(tpcb, p->tot_len);
    pbuf_free(p);
    return ERR_OK;
}

