embeddedci-com/benchpod-firmware/stm32h563/src/net_server.c
static void srv_err(void *arg, err_t err)
{
    (void)err;
    int id = conn_id_of(arg);
    if (id >= 0 && id < NET_MAX_CONN) { hw_worker_submit_closed(id); conn_pcb[id] = NULL; }
}

static err_t srv_accept(void *arg, struct tcp_pcb *newpcb, err_t err)
{
    (void)arg;
    if (err != ERR_OK || newpcb == NULL) return ERR_VAL;

    int id = -1;
    for (int i = 0; i < NET_MAX_CONN; i++) { if (conn_pcb[i] == NULL) { id = i; break; } }
    if (id < 0) { tcp_abort(newpcb); return ERR_ABRT; }   /* too many clients */

    conn_tx_reset(id);           /* clear any stale bytes from a prior conn on this slot */
    s_close_req[id]   = 0;
    s_nodelay_req[id] = -1;
    conn_pcb[id] = newpcb;
    tcp_setprio(newpcb, TCP_PRIO_MIN);
    tcp_arg(newpcb, (void *)(intptr_t)(id + 1));
    tcp_recv(newpcb, srv_recv);
    tcp_err(newpcb, srv_err);
    return ERR_OK;
}

/* Drain the per-connection TX rings the worker filled: real TCP conns straight
   into lwIP (bounded by tcp_sndbuf), cloud tunnels via the WS framing (bounded by
   the TLS/WS send buffer).  Net task only. */
static void net_tx_drain(void)
{
    for (int id = 0; id < NET_MAX_CONN; id++) {
        struct tcp_pcb *pcb = conn_pcb[id];
        if (!pcb) continue;
        bool wrote = false;
        const uint8_t *chunk;
        size_t n;
        while ((n = conn_tx_peek(id, &chunk)) > 0) {
            u16_t sb = tcp_sndbuf(pcb);
            if (sb == 0) break;
            if (n > sb) n = sb;
            if (tcp_write(pcb, chunk, (u16_t)n, TCP_WRITE_FLAG_COPY) != ERR_OK) break;
            conn_tx_advance(id, n);
            wrote = true;
        }
        if (wrote) tcp_output(pcb);
    }
    for (int t = 0; t < CH_CLOUD_TUNNEL_CONN_COUNT; t++) {
        int id = CH_CLOUD_TUNNEL_CONN + t;
        size_t used = conn_tx_used(id);
        if (!used) continue;
        size_t avail = cloud_client_tunnel_avail(id);   /* raw bytes the WS buffer can take now */
        if (avail == 0) continue;
        const uint8_t *chunk;
        size_t n = conn_tx_peek(id, &chunk);
        if (n > avail) n = avail;
        cloud_client_tunnel_out(id, chunk, n);          /* frames + altcp on the net task */
        conn_tx_advance(id, n);
    }
}

/* Apply the transport-control actions the worker requested (it can't touch lwIP):
   toggle Nagle, and close sockets (then tell the worker to clean up its state). */
static void net_apply_worker_requests(void)
{
    for (int id = 0; id < NET_MAX_CONN; id++) {
        if (s_nodelay_req[id] >= 0) {
            if (conn_pcb[id]) {
                if (s_nodelay_req[id]) tcp_nagle_disable(conn_pcb[id]);
                else                   tcp_nagle_enable(conn_pcb[id]);
            }
            s_nodelay_req[id] = -1;
        }
        if (s_close_req[id]) {
            s_close_req[id] = 0;
            if (conn_pcb[id]) {
                struct tcp_pcb *pcb = conn_pcb[id];
                conn_pcb[id] = NULL;
                tcp_arg(pcb, NULL); tcp_recv(pcb, NULL); tcp_err(pcb, NULL);
                if (tcp_close(pcb) != ERR_OK) tcp_abort(pcb);
            }
            conn_tx_reset(id);
            hw_worker_submit_closed(id);   /* worker releases gate/stream state */
        }
    }
}

/* If the worker finished a cloud command.request, frame + send its reply. */
static void net_frame_cloud_reply(void)
{
    char        req_id[BP_TUNNEL_ID_MAX];
    static char reply[BP_CLOUD_REPLY_MAX];   /* net task only */
    size_t rl = 0;
    if (hw_worker_take_cloud_reply(req_id, sizeof(req_id), reply, sizeof(reply), &rl))
        cloud_client_send_command_response(req_id, reply, rl);
}

static void server_start(void)
{
    struct tcp_pcb *pcb = tcp_new();
    if (pcb == NULL) return;
    if (tcp_bind(pcb, IP_ADDR_ANY, TCP_SERVER_PORT) != ERR_OK) { memp_free(MEMP_TCP_PCB, pcb); return; }
    pcb = tcp_listen(pcb);
    tcp_accept(pcb, srv_accept);
}

/* ---- DHCP management (per interface) ----------------------------------- */
/* Drive the pure net_dhcp_step() state machine and perform the side effect it
   asks for. Link state is POLLED here (netif_is_link_up) every ~500 ms tick, so
   there is no dependence on a link-change callback edge being delivered — a
   missed edge can no longer strand us at 0.0.0.0 (net_dhcp self-heals from OFF
   when the link is up). */
static void dhcp_process(net_if_t *i)
{
    struct netif *netif = &i->netif;
    const char *tag = i->is_eth ? "eth" : "wifi";

    bool link_up   = netif_is_link_up(netif);
    bool has_lease = dhcp_supplied_address(netif);
    bool ip_changed = has_lease &&
                      strcmp(ip4addr_ntoa(netif_ip4_addr(netif)), i->ip) != 0;

    switch (net_dhcp_step(&i->dhcp, link_up, has_lease, ip_changed, DHCP_REKICK_TICKS)) {
    case NET_DHCP_DO_DISCOVER:
        ip_addr_set_zero_ip4(&netif->ip_addr);
        ip_addr_set_zero_ip4(&netif->netmask);
        ip_addr_set_zero_ip4(&netif->gw);
        dhcp_start(netif);
        printf("[net] %s DHCP: requesting address...\r\n", tag);
        break;
    case NET_DHCP_DO_REKICK:
        /* No static fallback: keep retrying forever so a slow/awkward home router
           is tolerated. lwIP retransmits DISCOVER on its own fine timer; this is
           a coarse backstop that forces a fresh DISCOVER if a lease still hasn't
           arrived after ~20 s (e.g. after the router finishes rebooting).

           Escalation (wired only): if several re-kicks in a row still yield no
           lease, re-sending DISCOVER clearly isn't the problem — the MAC/PHY or
           autoneg is likely wedged (a state a power cycle "fixes"). Do a PHY soft
           reset to re-establish the link from scratch, then re-acquire. This is
           the self-heal for a boot that got stuck at "requesting address" forever. */
        if (i->is_eth && ++i->dhcp_fails >= DHCP_ESCALATE_REKICKS) {
            i->dhcp_fails = 0;
            i->dhcp.state = NET_DHCP_OFF;   /* re-DISCOVER once the link is back up */
            i->dhcp.wait_ticks = 0;
            ethernetif_phy_restart(netif);
            printf("[net] %s DHCP: no lease after %d re-kicks — PHY reset + re-acquire\r\n",
                   tag, DHCP_ESCALATE_REKICKS);
            eth_diag_print();   /* the state that led to the reset */
            break;
        }
        dhcp_start(netif);
        printf("[net] %s DHCP: still no lease, re-probing...\r\n", tag);
        if (i->is_eth) eth_diag_print();
        break;
    case NET_DHCP_DO_BOUND:
        i->dhcp_fails = 0;
        strncpy(i->ip, ip4addr_ntoa(netif_ip4_addr(netif)), sizeof(i->ip) - 1);
        mdns_resp_announce(netif);   /* broadcast the now-valid A record */
        printf("[net] %s DHCP: ip=%s\r\n", tag, i->ip);
        break;
    case NET_DHCP_DO_IPCHANGE:
        /* Bound but the router handed out a different address on renew/rebind. */
        strncpy(i->ip, ip4addr_ntoa(netif_ip4_addr(netif)), sizeof(i->ip) - 1);
        mdns_resp_announce(netif);   /* re-broadcast the new A record */
        printf("[net] %s DHCP: address changed -> %s\r\n", tag, i->ip);
        break;
    case NET_DHCP_DO_LINKDOWN:
        strcpy(i->ip, "0.0.0.0");
        printf("[net] %s link down\r\n", tag);
        break;
    case NET_DHCP_DO_NOTHING:
    default:
        break;
    }
}

/* Ethernet-priority default route: wired when it has an address, else Wi-Fi when
   it is associated + addressed. Outbound traffic (cloud_client) follows this. */
static void update_default_route(void)
{
    struct netif *want = &s_eth.netif;   /* default to wired */
    if (iface_addressed(&s_eth) && netif_is_link_up(&s_eth.netif)) {
        want = &s_eth.netif;
    } else if (iface_addressed(&s_wifi) && netif_is_link_up(&s_wifi.netif)) {
        want = &s_wifi.netif;
    }
    if (netif_default != want) {
        netif_set_default(want);
        printf("[net] default route -> %s\r\n", (want == &s_eth.netif) ? "eth" : "wifi");
    }
}

/* Clear the wired netif's address + DHCP state so acquisition restarts clean. */
static void eth_reset_addr_state(void)
{
    dhcp_stop(&s_eth.netif);
    ip_addr_set_zero_ip4(&s_eth.netif.ip_addr);
    ip_addr_set_zero_ip4(&s_eth.netif.netmask);
    ip_addr_set_zero_ip4(&s_eth.netif.gw);
    s_eth.dhcp.state   = NET_DHCP_OFF;   /* dhcp_process re-DISCOVERs when the link is up */
    s_eth.dhcp.wait_ticks = 0;
    s_eth.dhcp_fails   = 0;
    strcpy(s_eth.ip, "0.0.0.0");
}

/* Apply a latched `eth` stop/start/restart request. Runs on the net task only
   (net_poll), so it can touch HAL_ETH + lwIP directly. */
static void net_eth_apply_request(void)
{
    eth_req_t req = s_eth_req;
    if (req == ETH_REQ_NONE) return;
    s_eth_req = ETH_REQ_NONE;

