embeddedci-com/benchpod-firmware/stm32h563/src/net_server.c
    switch (req) {
    case ETH_REQ_DOWN:
        s_eth_admin_down = true;
        ethernetif_stop(&s_eth.netif);
        eth_reset_addr_state();
        update_default_route();          /* fail over to Wi-Fi if it's up */
        printf("[net] eth: stopped (admin down)\r\n");
        break;
    case ETH_REQ_UP:
    case ETH_REQ_RESTART:
        s_eth_admin_down = false;
        eth_reset_addr_state();
        ethernetif_phy_restart(&s_eth.netif);   /* link re-negotiates; check_state re-ups */
        printf("[net] eth: %s — PHY reset, re-acquiring link + DHCP\r\n",
               req == ETH_REQ_UP ? "started" : "restarted");
        break;
    default:
        break;
    }
}

/* Public control seam (see net_server.h). Callable from any task — these only
   latch a request; net_poll() applies it on the net task. */
void net_eth_stop(void)    { s_eth_req = ETH_REQ_DOWN; }
void net_eth_start(void)   { s_eth_req = ETH_REQ_UP; }
void net_eth_restart(void) { s_eth_req = ETH_REQ_RESTART; }

/* ---- mDNS / DNS-SD responder ------------------------------------------------
   Advertises the pod as "_benchpod._tcp" so a client can browse the LAN and
   enumerate every pod at once (one PTR -> N instances, each with its own A
   record + TXT). The hostname and DNS-SD instance name are made unique from a
   slice of the device's Ed25519 public key, and the full public key travels in
   the TXT record as the stable, collision-proof identifier. The same hostname
   is registered on both netifs, so a multihomed pod shows up once and resolves
   to whichever interface answered. ---------------------------------------- */
static char s_mdns_host[24];   /* "benchpod-a1b2c3"               */
static char s_mdns_inst[32];   /* "BenchPod a1b2c3" (instance)    */
static char s_mdns_id[B64URL_ENCODED_LEN(DEVICE_ID_PUBLIC_LEN) + 1]; /* full pubkey */

static void mdns_build_identity(void)
{
    if (s_mdns_host[0]) return;                 /* build once */
    uint8_t pub[DEVICE_ID_PUBLIC_LEN] = {0};
    device_identity_get_public(pub);            /* leaves zeros if id not ready */

    /* 3-byte slice -> 6 hex chars: a 16M-instance space, ample for a bench LAN. */
    snprintf(s_mdns_host, sizeof(s_mdns_host), "benchpod-%02x%02x%02x",
             pub[0], pub[1], pub[2]);
    snprintf(s_mdns_inst, sizeof(s_mdns_inst), "BenchPod %02x%02x%02x",
             pub[0], pub[1], pub[2]);
    b64url_encode(pub, sizeof(pub), s_mdns_id, sizeof(s_mdns_id));
}

/* TXT builder: clients read these to tell pods apart without connecting. */
static void mdns_txt(struct mdns_service *svc, void *arg)
{
    (void)arg;
    char kv[B64URL_ENCODED_LEN(DEVICE_ID_PUBLIC_LEN) + 8];
    int n;
    n = snprintf(kv, sizeof(kv), "id=%s",   s_mdns_id);       mdns_resp_add_service_txtitem(svc, kv, n);
    n = snprintf(kv, sizeof(kv), "host=%s", s_mdns_host);     mdns_resp_add_service_txtitem(svc, kv, n);
    n = snprintf(kv, sizeof(kv), "port=%d", TCP_SERVER_PORT); mdns_resp_add_service_txtitem(svc, kv, n);
}

static void mdns_register(struct netif *netif)
{
    mdns_build_identity();
    if (mdns_resp_add_netif(netif, s_mdns_host) != ERR_OK) return;
    mdns_resp_add_service(netif, s_mdns_inst, "_benchpod", DNSSD_PROTO_TCP,
                          TCP_SERVER_PORT, mdns_txt, NULL);
}

/* ---- public API -------------------------------------------------------- */
void net_init(void)
{
    ip_addr_t zero;
    ip_addr_set_zero_ip4(&zero);

    for (int i = 0; i < NET_MAX_CONN; i++) s_nodelay_req[i] = -1;   /* -1 = no pending toggle */

    /* Route mbedTLS allocation to the FreeRTOS heap before any TLS work (the
       outbound WSS cloud client uses it). */
    mbedtls_port_init();

    lwip_init();
    mdns_resp_init();

    /* Ethernet netif (always present, default route). dhcp_process() polls the
       link every tick (netif_is_link_up), so no link-change callback is wired. */
    netif_add(&s_eth.netif, &zero, &zero, &zero, NULL, &ethernetif_init, &ethernet_input);
    /* The ETH MAC inserts IP/UDP/TCP checksums in hardware, so leave those OFF in
       software (netif_add defaults to ENABLE_ALL — computing them in software too
       would clash with the MAC's pseudo-header insertion and corrupt UDP/TCP).
       ICMP stays software. The Wi-Fi netif (no HW) enables all — see esp_netif.c. */
    NETIF_SET_CHECKSUM_CTRL(&s_eth.netif,
        NETIF_CHECKSUM_ENABLE_ALL & ~(NETIF_CHECKSUM_GEN_IP |
                                      NETIF_CHECKSUM_GEN_UDP |
                                      NETIF_CHECKSUM_GEN_TCP));
    netif_set_default(&s_eth.netif);
    mdns_register(&s_eth.netif);

    /* Wi-Fi netif over the ESP32-C3. The netif is registered (inert until the
       link comes up); the co-processor itself stays in reset until Wi-Fi is
       provisioned, gated inside esp_wifi_ctrl. */
    esp_hosted_spi_init();
    netif_add(&s_wifi.netif, &zero, &zero, &zero, NULL, &esp_netif_init, &ethernet_input);
    mdns_register(&s_wifi.netif);
    esp_wifi_ctrl_init();

    server_start();
    cloud_client_init();   /* outbound WSS control channel (if provisioned) */
    printf("[net] LwIP up — eth(RMII/LAN8742) + wifi(ESP32-C3), TCP server on :%d\r\n",
           TCP_SERVER_PORT);
}

void net_poll(void)
{
    ethernetif_input(&s_eth.netif);
    esp_hosted_spi_poll();           /* pump the Wi-Fi SPI transport (RX/TX)   */
    sys_check_timeouts();

    /* The net task owns lwIP; it no longer runs command_handler (that moved to
       the hw worker).  It drives the WS/Wi-Fi transport, then moves the worker's
       queued replies into lwIP and applies the worker's close/nodelay requests. */
    cloud_client_poll();             /* drive the outbound WSS control channel */
    esp_wifi_ctrl_poll();            /* drive Wi-Fi association (if configured) */
    net_tx_drain();                  /* worker reply rings -> lwIP              */
    net_apply_worker_requests();     /* worker-requested close / Nagle toggles  */
    net_frame_cloud_reply();         /* a finished cloud command -> response    */
    net_eth_apply_request();         /* apply a pending eth stop/start/restart  */

    uint32_t now = HAL_GetTick();
    if (now - link_timer >= 100) {
        link_timer = now;
        /* While the wired link is held down by `eth stop`, skip the link check so
           it stays down until an explicit `eth start` (the check would otherwise
           re-up it as soon as the PHY reports link). */
        if (!s_eth_admin_down) ethernet_link_check_state(&s_eth.netif);
        update_default_route();
    }
    if (!s_eth_admin_down) eth_diag_poll(&s_eth.netif, now);
    if (!s_eth_admin_down && now - s_eth.dhcp_timer >= 500) { s_eth.dhcp_timer  = now; dhcp_process(&s_eth);  }
    if (!s_wifi_static && now - s_wifi.dhcp_timer >= 500) { s_wifi.dhcp_timer = now; dhcp_process(&s_wifi); }
}

/* Bring-up diagnostic: pin a static IP on the Wi-Fi netif (disables DHCP on it)
   so a peer can ping the pod — a definitive test of whether the esp-hosted bridge
   delivers UNICAST-to-STA frames to this host. `mask`/`gw` dotted-quad. */
void net_wifi_static(const char *ip_s, const char *mask_s, const char *gw_s)
{
    ip4_addr_t ip, mask, gw;
    if (!ip4addr_aton(ip_s, &ip) || !ip4addr_aton(mask_s, &mask) || !ip4addr_aton(gw_s, &gw)) {
        printf("[net] wifi-static: bad address\r\n");
        return;
    }
    dhcp_stop(&s_wifi.netif);
    netif_set_addr(&s_wifi.netif, &ip, &mask, &gw);
    netif_set_up(&s_wifi.netif);
    netif_set_link_up(&s_wifi.netif);
    strncpy(s_wifi.ip, ip4addr_ntoa(&ip), sizeof(s_wifi.ip) - 1);
    s_wifi.dhcp.state = NET_DHCP_DONE;
    s_wifi_static = true;
    printf("[net] wifi static ip=%s gw=%s (DHCP off on wifi — ping to test unicast RX)\r\n",
           s_wifi.ip, gw_s);
}

const char *net_ip_str(void) { return wifi_get_ip(); }

/* Wired MAC as "aa:bb:cc:dd:ee:ff" (set by ethernetif_init). Returned in a
   static buffer — single-threaded console/command use only. */
const char *net_mac_str(void)
{
    static char buf[18];
    const uint8_t *m = s_eth.netif.hwaddr;
    snprintf(buf, sizeof(buf), "%02x:%02x:%02x:%02x:%02x:%02x",
             m[0], m[1], m[2], m[3], m[4], m[5]);
    return buf;
}
